export const playerCountData = [
  [5, 3, 0, 1, 1],
  [6, 3, 1, 1, 1],
  [7, 5, 0, 2, 1],
  [8, 5, 1, 1, 1],
  [9, 5, 2, 1, 1],
  [10, 7, 0, 2, 1],
  [11, 7, 1, 2, 1],
  [12, 7, 2, 2, 1],
  [13, 9, 0, 3, 1],
  [14, 9, 1, 3, 1],
  [15, 9, 2, 3, 1],
  [16, 10, 2, 3, 1],
  [17, 11, 2, 3, 1],
  [18, 12, 2, 3, 1],
]

export const townsfolkRoles = [
  "洗衣妇",
  "图书管理员",
  "调查员",
  "厨师",
  "共情者",
  "占卜师",
  "送葬者",
  "僧侣",
  "渡鸦",
  "处女",
  "杀手",
  "士兵",
  "市长",
  "小精灵",
]

export const outsiderRoles = [
  "管家",
  "酒鬼",
  "隐士",
  "圣徒",
]

export const minionRoles = [
  "投毒者",
  "间谍",
  "猩红女郎",
  "男爵",
]

export const translations = {
  "townsfolk": "村民",
  "outsider": "外来者",
  "minion": "爪牙",
  "demon": "恶魔",
}

export const FIRST_NIGHT_ORDER = [
  "爪牙",
  "小恶魔",
  "男爵",
  "投毒者",
  "猩红女郎",
  "洗衣妇",
  "图书管理员",
  "调查员",
  "厨师",
  "共情者",
  "占卜师",
  "管家",
  "间谍",
  "小精灵",
]

export const OTHER_NIGHTS_ORDER = [
  "投毒者",
  "僧侣",
  "猩红女郎",
  "小恶魔",
  "渡鸦",
  "共情者",
  "占卜师",
  "管家",
  "送葬者",
  "间谍",
] 